clc;
clear;
% 雇佣员工题
% 1.列式子
% 全时服务员:x1
% 半时服务员:x2

% min:100x1+40x2

% 1.1
% y1+y2<=3
% x+y1>=6
% x+y2>=8
% x+y1+y2>=11
%
% 1.2
% x>=11  
% 1.3
% x+y1>=6
% x+y2>=8
% x+y1+y2>=11



c = [100, 40, 40];
A = [0, 1, 1; -1, -1, 0; -1, 0, -1; -1, -1, -1];
b = [3; -6; -8; -11];
Aeq = [];
beq = [];
vlb = [0, 0, 0];
vub = [];
[x, fval] = linprog(c, A, b, Aeq, beq, vlb, vub);
% %%%
x
fval
% %%%
fprintf('1.最少雇佣8人全职3人半职\n');

fprintf('2.雇佣11全职,多增加180元雇佣费\n');

c = [100, 40, 40];
A = [ -1, -1, 0; -1, 0, -1; -1, -1, -1];
b = [ -6; -8; -11];
Aeq = [];
beq = [];
vlb = [0, 0, 0];
vub = [];
[x, fval] = linprog(c, A, b, Aeq, beq, vlb, vub);
% %%%
x
fval
% %%%
fprintf('3.不限制上午6下午8每天减少360雇佣费\n');